{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : -3,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "mixture",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "37",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "37",
      "begin_48" : 0,
      "top" : "37_0,37_1",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "bottom" : "37_0",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "40",
      "top" : "40",
      "type" : "elementwise",
      "name" : "40",
      "beta" : 0
    },
    {
      "bottom" : "37_1",
      "alpha" : 2,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "42",
      "top" : "42",
      "type" : "elementwise",
      "name" : "42",
      "beta" : 0
    },
    {
      "bottom" : "40,42",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "44",
      "top" : "44",
      "type" : "elementwise",
      "name" : "44",
      "beta" : 0
    },
    {
      "bottom" : "44",
      "alpha" : 0.5,
      "operation" : 13,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "46",
      "top" : "46",
      "type" : "elementwise",
      "name" : "46",
      "beta" : 0
    },
    {
      "bottom" : "46",
      "alpha" : 1.000000013351432e-10,
      "operation" : 119,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "x.1",
      "top" : "x.1",
      "type" : "elementwise",
      "name" : "x.1",
      "beta" : 3.3999999521443642e+38
    },
    {
      "begin_104" : 0,
      "begin_63" : 0,
      "begin_59" : 0,
      "begin_64" : 0,
      "begin_105" : 0,
      "begin_65" : 0,
      "begin_0" : 0,
      "begin_70" : 0,
      "begin_66" : 0,
      "begin_106" : 0,
      "begin_110" : 0,
      "begin_2" : 0,
      "begin_71" : 0,
      "begin_67" : 0,
      "begin_68" : 0,
      "begin_107" : 0,
      "begin_111" : 0,
      "begin_4" : 0,
      "begin_72" : 0,
      "begin_73" : 0,
      "begin_69" : 0,
      "begin_6" : 0,
      "begin_74" : 0,
      "begin_108" : 0,
      "type" : "split_nd",
      "begin_8" : 0,
      "begin_112" : 0,
      "begin_75" : 0,
      "begin_10" : 0,
      "begin_80" : 0,
      "begin_76" : 0,
      "begin_109" : 0,
      "begin_113" : 0,
      "begin_11" : 0,
      "nd_axis" : -1,
      "begin_81" : 0,
      "begin_77" : 0,
      "begin_114" : 0,
      "begin_12" : 0,
      "begin_78" : 0,
      "begin_82" : 0,
      "begin_13" : 0,
      "begin_83" : 0,
      "begin_79" : 0,
      "begin_115" : 0,
      "begin_14" : 0,
      "begin_84" : 0,
      "begin_15" : 0,
      "begin_85" : 0,
      "num_splits" : 4,
      "begin_116" : 0,
      "begin_120" : 0,
      "begin_20" : 0,
      "begin_86" : 0,
      "begin_16" : 0,
      "begin_90" : 0,
      "begin_21" : 0,
      "begin_91" : 0,
      "begin_87" : 0,
      "begin_17" : 0,
      "begin_117" : 0,
      "begin_121" : 0,
      "begin_18" : 0,
      "begin_92" : 0,
      "begin_88" : 0,
      "begin_22" : 0,
      "begin_23" : 0,
      "begin_89" : 0,
      "begin_19" : 0,
      "begin_93" : 0,
      "begin_118" : 0,
      "begin_122" : 0,
      "begin_24" : 0,
      "begin_94" : 0,
      "begin_25" : 0,
      "begin_95" : 0,
      "begin_119" : 0,
      "begin_123" : 0,
      "begin_30" : 0,
      "begin_26" : 0,
      "begin_96" : 0,
      "begin_124" : 0,
      "begin_31" : 0,
      "begin_97" : 0,
      "begin_27" : 0,
      "begin_28" : 0,
      "begin_98" : 0,
      "begin_32" : 0,
      "begin_125" : 0,
      "begin_33" : 0,
      "begin_29" : 0,
      "begin_99" : 0,
      "begin_1" : 0,
      "weights" : {

      },
      "begin_34" : 0,
      "bottom" : "x.1",
      "begin_3" : 0,
      "begin_126" : 0,
      "begin_35" : 0,
      "begin_5" : 0,
      "begin_36" : 0,
      "begin_40" : 0,
      "begin_127" : 0,
      "name" : "50",
      "begin_41" : 0,
      "begin_37" : 0,
      "begin_7" : 0,
      "begin_42" : 0,
      "begin_38" : 0,
      "begin_9" : 0,
      "begin_39" : 0,
      "begin_43" : 0,
      "begin_44" : 0,
      "begin_45" : 0,
      "begin_50" : 0,
      "begin_46" : 0,
      "begin_51" : 0,
      "begin_47" : 0,
      "begin_100" : 0,
      "begin_52" : 0,
      "debug_info" : "50",
      "begin_48" : 0,
      "top" : "50_0,50_1,50_2,50_3",
      "begin_101" : 0,
      "begin_53" : 0,
      "begin_49" : 0,
      "begin_54" : 0,
      "begin_55" : 0,
      "begin_102" : 0,
      "begin_60" : 0,
      "begin_56" : 0,
      "begin_103" : 0,
      "begin_57" : 0,
      "begin_61" : 0,
      "begin_62" : 0,
      "begin_58" : 0
    },
    {
      "weights" : {

      },
      "debug_info" : "input.1",
      "top" : "input.1",
      "type" : "concat",
      "name" : "input.1",
      "bottom" : "50_0,50_1,50_2,50_3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.7",
      "blob_weights" : 3,
      "K" : 8,
      "blob_biases" : 1,
      "name" : "input.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.1",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.11",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.1",
      "blob_weights" : 7,
      "K" : 64,
      "blob_biases" : 5,
      "name" : "input.11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.7",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.13",
      "top" : "input.13__tmp__identity__",
      "type" : "concat",
      "name" : "input.13",
      "bottom" : "x_.1,input.7"
    },
    {
      "bottom" : "input.13__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.13",
      "top" : "input.13",
      "type" : "activation",
      "name" : "input.13__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.17",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.3",
      "blob_weights" : 11,
      "K" : 128,
      "blob_biases" : 9,
      "name" : "input.17",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.19",
      "top" : "input.19",
      "type" : "concat",
      "name" : "input.19",
      "bottom" : "x_.3,input.13"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.23",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.25",
      "blob_weights" : 15,
      "K" : 192,
      "blob_biases" : 13,
      "name" : "input.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.19",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 256,
      "top" : "input.27",
      "has_biases" : 1,
      "blob_biases" : 17,
      "nC" : 16,
      "blob_weights" : 19,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.25",
      "debug_info" : "input.27",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.27",
      "has_prelu" : 0
    },
    {
      "name" : "input.29",
      "bottom" : "input.27",
      "weights" : {

      },
      "debug_info" : "input.29",
      "top" : "input.29",
      "C" : 64,
      "blob_batchnorm_params" : 21,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.29",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.31",
      "top" : "input.31",
      "type" : "activation",
      "name" : "input.31"
    },
    {
      "nB" : 16,
      "top" : "input.33",
      "has_biases" : 1,
      "blob_biases" : 23,
      "nC" : 256,
      "blob_weights" : 25,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.31",
      "debug_info" : "input.33",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.33",
      "has_prelu" : 0
    },
    {
      "name" : "input.35",
      "bottom" : "input.33",
      "weights" : {

      },
      "debug_info" : "input.35",
      "top" : "input.35",
      "C" : 64,
      "blob_batchnorm_params" : 27,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.35",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "163",
      "top" : "163",
      "type" : "activation",
      "name" : "163"
    },
    {
      "bottom" : "input.25,163",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.37",
      "top" : "input.37",
      "type" : "elementwise",
      "name" : "input.37",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.41",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.43",
      "blob_weights" : 31,
      "K" : 64,
      "blob_biases" : 29,
      "stride_x" : 2,
      "name" : "input.41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.37",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.47",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.5",
      "blob_weights" : 35,
      "K" : 64,
      "blob_biases" : 33,
      "name" : "input.47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.43",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.49",
      "top" : "input.49__tmp__identity__",
      "type" : "concat",
      "name" : "input.49",
      "bottom" : "x_.5,input.43"
    },
    {
      "bottom" : "input.49__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.49",
      "top" : "input.49",
      "type" : "activation",
      "name" : "input.49__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.53",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.7",
      "blob_weights" : 39,
      "K" : 128,
      "blob_biases" : 37,
      "name" : "input.53",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.49",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.55",
      "top" : "input.55",
      "type" : "concat",
      "name" : "input.55",
      "bottom" : "x_.7,input.49"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.59",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.61",
      "blob_weights" : 43,
      "K" : 192,
      "blob_biases" : 41,
      "name" : "input.59",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.55",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 128,
      "top" : "input.63",
      "has_biases" : 1,
      "blob_biases" : 45,
      "nC" : 16,
      "blob_weights" : 47,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.61",
      "debug_info" : "input.63",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.63",
      "has_prelu" : 0
    },
    {
      "name" : "input.65",
      "bottom" : "input.63",
      "weights" : {

      },
      "debug_info" : "input.65",
      "top" : "input.65",
      "C" : 64,
      "blob_batchnorm_params" : 49,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.65",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.67",
      "top" : "input.67",
      "type" : "activation",
      "name" : "input.67"
    },
    {
      "nB" : 16,
      "top" : "input.69",
      "has_biases" : 1,
      "blob_biases" : 51,
      "nC" : 128,
      "blob_weights" : 53,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.67",
      "debug_info" : "input.69",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.69",
      "has_prelu" : 0
    },
    {
      "name" : "input.71",
      "bottom" : "input.69",
      "weights" : {

      },
      "debug_info" : "input.71",
      "top" : "input.71",
      "C" : 64,
      "blob_batchnorm_params" : 55,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.71",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "272",
      "top" : "272",
      "type" : "activation",
      "name" : "272"
    },
    {
      "bottom" : "input.61,272",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.73",
      "top" : "input.73",
      "type" : "elementwise",
      "name" : "input.73",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.77",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.79",
      "blob_weights" : 59,
      "K" : 64,
      "blob_biases" : 57,
      "stride_x" : 2,
      "name" : "input.77",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.73",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.83",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.9",
      "blob_weights" : 63,
      "K" : 64,
      "blob_biases" : 61,
      "name" : "input.83",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.79",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.85",
      "top" : "input.85__tmp__identity__",
      "type" : "concat",
      "name" : "input.85",
      "bottom" : "x_.9,input.79"
    },
    {
      "bottom" : "input.85__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.85",
      "top" : "input.85",
      "type" : "activation",
      "name" : "input.85__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.89",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.11",
      "blob_weights" : 67,
      "K" : 128,
      "blob_biases" : 65,
      "name" : "input.89",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.85",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.91",
      "top" : "input.91",
      "type" : "concat",
      "name" : "input.91",
      "bottom" : "x_.11,input.85"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.95",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.97",
      "blob_weights" : 71,
      "K" : 192,
      "blob_biases" : 69,
      "name" : "input.95",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.91",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 64,
      "top" : "input.99",
      "has_biases" : 1,
      "blob_biases" : 73,
      "nC" : 16,
      "blob_weights" : 75,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.97",
      "debug_info" : "input.99",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.99",
      "has_prelu" : 0
    },
    {
      "name" : "input.101",
      "bottom" : "input.99",
      "weights" : {

      },
      "debug_info" : "input.101",
      "top" : "input.101",
      "C" : 64,
      "blob_batchnorm_params" : 77,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.101",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.103",
      "top" : "input.103",
      "type" : "activation",
      "name" : "input.103"
    },
    {
      "nB" : 16,
      "top" : "input.105",
      "has_biases" : 1,
      "blob_biases" : 79,
      "nC" : 64,
      "blob_weights" : 81,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.103",
      "debug_info" : "input.105",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.105",
      "has_prelu" : 0
    },
    {
      "name" : "input.107",
      "bottom" : "input.105",
      "weights" : {

      },
      "debug_info" : "input.107",
      "top" : "input.107",
      "C" : 64,
      "blob_batchnorm_params" : 83,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.107",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "381",
      "top" : "381",
      "type" : "activation",
      "name" : "381"
    },
    {
      "bottom" : "input.97,381",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.109",
      "top" : "input.109",
      "type" : "elementwise",
      "name" : "input.109",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.113",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.115",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "stride_x" : 2,
      "name" : "input.113",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.109",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.119",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.13",
      "blob_weights" : 91,
      "K" : 64,
      "blob_biases" : 89,
      "name" : "input.119",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.115",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.121",
      "top" : "input.121__tmp__identity__",
      "type" : "concat",
      "name" : "input.121",
      "bottom" : "x_.13,input.115"
    },
    {
      "bottom" : "input.121__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.121",
      "top" : "input.121",
      "type" : "activation",
      "name" : "input.121__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.125",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.15",
      "blob_weights" : 95,
      "K" : 128,
      "blob_biases" : 93,
      "name" : "input.125",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.121",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.127",
      "top" : "input.127",
      "type" : "concat",
      "name" : "input.127",
      "bottom" : "x_.15,input.121"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.131",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.133",
      "blob_weights" : 99,
      "K" : 192,
      "blob_biases" : 97,
      "name" : "input.131",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.127",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 32,
      "top" : "input.135",
      "has_biases" : 1,
      "blob_biases" : 101,
      "nC" : 16,
      "blob_weights" : 103,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.133",
      "debug_info" : "input.135",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.135",
      "has_prelu" : 0
    },
    {
      "name" : "input.137",
      "bottom" : "input.135",
      "weights" : {

      },
      "debug_info" : "input.137",
      "top" : "input.137",
      "C" : 64,
      "blob_batchnorm_params" : 105,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.137",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.139",
      "top" : "input.139",
      "type" : "activation",
      "name" : "input.139"
    },
    {
      "nB" : 16,
      "top" : "input.141",
      "has_biases" : 1,
      "blob_biases" : 107,
      "nC" : 32,
      "blob_weights" : 109,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.139",
      "debug_info" : "input.141",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.141",
      "has_prelu" : 0
    },
    {
      "name" : "input.143",
      "bottom" : "input.141",
      "weights" : {

      },
      "debug_info" : "input.143",
      "top" : "input.143",
      "C" : 64,
      "blob_batchnorm_params" : 111,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.143",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "490",
      "top" : "490",
      "type" : "activation",
      "name" : "490"
    },
    {
      "bottom" : "input.133,490",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.145",
      "top" : "input.145",
      "type" : "elementwise",
      "name" : "input.145",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.149",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.151",
      "blob_weights" : 115,
      "K" : 64,
      "blob_biases" : 113,
      "stride_x" : 2,
      "name" : "input.149",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.145",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.155",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.17",
      "blob_weights" : 119,
      "K" : 64,
      "blob_biases" : 117,
      "name" : "input.155",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.151",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.157",
      "top" : "input.157__tmp__identity__",
      "type" : "concat",
      "name" : "input.157",
      "bottom" : "x_.17,input.151"
    },
    {
      "bottom" : "input.157__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.157",
      "top" : "input.157",
      "type" : "activation",
      "name" : "input.157__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.161",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.19",
      "blob_weights" : 123,
      "K" : 128,
      "blob_biases" : 121,
      "name" : "input.161",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.157",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.163",
      "top" : "input.163",
      "type" : "concat",
      "name" : "input.163",
      "bottom" : "x_.19,input.157"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.167",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.169",
      "blob_weights" : 127,
      "K" : 192,
      "blob_biases" : 125,
      "name" : "input.167",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.163",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 16,
      "top" : "input.171",
      "has_biases" : 1,
      "blob_biases" : 129,
      "nC" : 16,
      "blob_weights" : 131,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.169",
      "debug_info" : "input.171",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.171",
      "has_prelu" : 0
    },
    {
      "name" : "input.173",
      "bottom" : "input.171",
      "weights" : {

      },
      "debug_info" : "input.173",
      "top" : "input.173",
      "C" : 64,
      "blob_batchnorm_params" : 133,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.173",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.175",
      "top" : "input.175",
      "type" : "activation",
      "name" : "input.175"
    },
    {
      "nB" : 16,
      "top" : "input.177",
      "has_biases" : 1,
      "blob_biases" : 135,
      "nC" : 16,
      "blob_weights" : 137,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.175",
      "debug_info" : "input.177",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.177",
      "has_prelu" : 0
    },
    {
      "name" : "input.179",
      "bottom" : "input.177",
      "weights" : {

      },
      "debug_info" : "input.179",
      "top" : "input.179",
      "C" : 64,
      "blob_batchnorm_params" : 139,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.179",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "599",
      "top" : "599",
      "type" : "activation",
      "name" : "599"
    },
    {
      "bottom" : "input.169,599",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.181",
      "top" : "input.181",
      "type" : "elementwise",
      "name" : "input.181",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.185",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.3",
      "blob_weights" : 143,
      "K" : 64,
      "blob_biases" : 141,
      "stride_x" : 2,
      "name" : "input.185",
      "deconv_out_height" : 8,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.181",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 32,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.187",
      "top" : "input.187__tmp__identity__",
      "type" : "concat",
      "name" : "input.187",
      "bottom" : "x.3,input.145"
    },
    {
      "bottom" : "input.187__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.187",
      "top" : "input.187",
      "type" : "activation",
      "name" : "input.187__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.191",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.21",
      "blob_weights" : 147,
      "K" : 128,
      "blob_biases" : 145,
      "name" : "input.191",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.187",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.193",
      "top" : "input.193__tmp__identity__",
      "type" : "concat",
      "name" : "input.193",
      "bottom" : "x_.21,input.187"
    },
    {
      "bottom" : "input.193__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.193",
      "top" : "input.193",
      "type" : "activation",
      "name" : "input.193__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.197",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.23",
      "blob_weights" : 151,
      "K" : 192,
      "blob_biases" : 149,
      "name" : "input.197",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.193",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.199",
      "top" : "input.199",
      "type" : "concat",
      "name" : "input.199",
      "bottom" : "x_.23,input.193"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.203",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.205",
      "blob_weights" : 155,
      "K" : 256,
      "blob_biases" : 153,
      "name" : "input.203",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.199",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 32,
      "top" : "input.207",
      "has_biases" : 1,
      "blob_biases" : 157,
      "nC" : 16,
      "blob_weights" : 159,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.205",
      "debug_info" : "input.207",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.207",
      "has_prelu" : 0
    },
    {
      "name" : "input.209",
      "bottom" : "input.207",
      "weights" : {

      },
      "debug_info" : "input.209",
      "top" : "input.209",
      "C" : 64,
      "blob_batchnorm_params" : 161,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.209",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.211",
      "top" : "input.211",
      "type" : "activation",
      "name" : "input.211"
    },
    {
      "nB" : 16,
      "top" : "input.213",
      "has_biases" : 1,
      "blob_biases" : 163,
      "nC" : 32,
      "blob_weights" : 165,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.211",
      "debug_info" : "input.213",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.213",
      "has_prelu" : 0
    },
    {
      "name" : "input.215",
      "bottom" : "input.213",
      "weights" : {

      },
      "debug_info" : "input.215",
      "top" : "input.215",
      "C" : 64,
      "blob_batchnorm_params" : 167,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.215",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "711",
      "top" : "711",
      "type" : "activation",
      "name" : "711"
    },
    {
      "bottom" : "input.205,711",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.217",
      "top" : "input.217",
      "type" : "elementwise",
      "name" : "input.217",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.221",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.5",
      "blob_weights" : 171,
      "K" : 64,
      "blob_biases" : 169,
      "stride_x" : 2,
      "name" : "input.221",
      "deconv_out_height" : 16,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.217",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 64,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.223",
      "top" : "input.223__tmp__identity__",
      "type" : "concat",
      "name" : "input.223",
      "bottom" : "x.5,input.109"
    },
    {
      "bottom" : "input.223__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.223",
      "top" : "input.223",
      "type" : "activation",
      "name" : "input.223__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.227",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.25",
      "blob_weights" : 175,
      "K" : 128,
      "blob_biases" : 173,
      "name" : "input.227",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.223",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.229",
      "top" : "input.229__tmp__identity__",
      "type" : "concat",
      "name" : "input.229",
      "bottom" : "x_.25,input.223"
    },
    {
      "bottom" : "input.229__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.229",
      "top" : "input.229",
      "type" : "activation",
      "name" : "input.229__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.233",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.27",
      "blob_weights" : 179,
      "K" : 192,
      "blob_biases" : 177,
      "name" : "input.233",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.229",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.235",
      "top" : "input.235",
      "type" : "concat",
      "name" : "input.235",
      "bottom" : "x_.27,input.229"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.239",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.241",
      "blob_weights" : 183,
      "K" : 256,
      "blob_biases" : 181,
      "name" : "input.239",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.235",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 64,
      "top" : "input.243",
      "has_biases" : 1,
      "blob_biases" : 185,
      "nC" : 16,
      "blob_weights" : 187,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.241",
      "debug_info" : "input.243",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.243",
      "has_prelu" : 0
    },
    {
      "name" : "input.245",
      "bottom" : "input.243",
      "weights" : {

      },
      "debug_info" : "input.245",
      "top" : "input.245",
      "C" : 64,
      "blob_batchnorm_params" : 189,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.245",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.247",
      "top" : "input.247",
      "type" : "activation",
      "name" : "input.247"
    },
    {
      "nB" : 16,
      "top" : "input.249",
      "has_biases" : 1,
      "blob_biases" : 191,
      "nC" : 64,
      "blob_weights" : 193,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.247",
      "debug_info" : "input.249",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.249",
      "has_prelu" : 0
    },
    {
      "name" : "input.251",
      "bottom" : "input.249",
      "weights" : {

      },
      "debug_info" : "input.251",
      "top" : "input.251",
      "C" : 64,
      "blob_batchnorm_params" : 195,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.251",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "823",
      "top" : "823",
      "type" : "activation",
      "name" : "823"
    },
    {
      "bottom" : "input.241,823",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.253",
      "top" : "input.253",
      "type" : "elementwise",
      "name" : "input.253",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.257",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.7",
      "blob_weights" : 199,
      "K" : 64,
      "blob_biases" : 197,
      "stride_x" : 2,
      "name" : "input.257",
      "deconv_out_height" : 32,
      "has_batch_norm" : 0,
      "type" : "deconvolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.253",
      "weights" : {

      },
      "Nx" : 2,
      "pad_mode" : 0,
      "deconv_out_width" : 128,
      "pad_value" : 0,
      "Ny" : 2,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.259",
      "top" : "input.259__tmp__identity__",
      "type" : "concat",
      "name" : "input.259",
      "bottom" : "x.7,input.73"
    },
    {
      "bottom" : "input.259__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.259",
      "top" : "input.259",
      "type" : "activation",
      "name" : "input.259__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.263",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.29",
      "blob_weights" : 203,
      "K" : 128,
      "blob_biases" : 201,
      "name" : "input.263",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.259",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.265",
      "top" : "input.265__tmp__identity__",
      "type" : "concat",
      "name" : "input.265",
      "bottom" : "x_.29,input.259"
    },
    {
      "bottom" : "input.265__tmp__identity__",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "input.265",
      "top" : "input.265",
      "type" : "activation",
      "name" : "input.265__tmp__identity__",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.269",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "x_.31",
      "blob_weights" : 207,
      "K" : 192,
      "blob_biases" : 205,
      "name" : "input.269",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.265",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "weights" : {

      },
      "debug_info" : "input.271",
      "top" : "input.271",
      "type" : "concat",
      "name" : "input.271",
      "bottom" : "x_.31,input.265"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.275",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.277",
      "blob_weights" : 211,
      "K" : 256,
      "blob_biases" : 209,
      "name" : "input.275",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.271",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "nB" : 128,
      "top" : "input.279",
      "has_biases" : 1,
      "blob_biases" : 213,
      "nC" : 16,
      "blob_weights" : 215,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.277",
      "debug_info" : "input.279",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.279",
      "has_prelu" : 0
    },
    {
      "name" : "input.281",
      "bottom" : "input.279",
      "weights" : {

      },
      "debug_info" : "input.281",
      "top" : "input.281",
      "C" : 64,
      "blob_batchnorm_params" : 217,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.281",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "input.283",
      "top" : "input.283",
      "type" : "activation",
      "name" : "input.283"
    },
    {
      "nB" : 16,
      "top" : "input.285",
      "has_biases" : 1,
      "blob_biases" : 219,
      "nC" : 128,
      "blob_weights" : 221,
      "weights" : {

      },
      "type" : "inner_product",
      "has_relu" : 0,
      "bottom" : "input.283",
      "debug_info" : "input.285",
      "has_tanh" : 0,
      "nd_mode" : true,
      "name" : "input.285",
      "has_prelu" : 0
    },
    {
      "name" : "input.287",
      "bottom" : "input.285",
      "weights" : {

      },
      "debug_info" : "input.287",
      "top" : "input.287",
      "C" : 64,
      "blob_batchnorm_params" : 223,
      "type" : "batchnorm"
    },
    {
      "bottom" : "input.287",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "935",
      "top" : "935",
      "type" : "activation",
      "name" : "935"
    },
    {
      "bottom" : "input.277,935",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.289",
      "top" : "input.289",
      "type" : "elementwise",
      "name" : "input.289",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.293",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "x.9",
      "blob_weights" : 227,
      "K" : 64,
      "blob_biases" : 225,
      "stride_x" : 2,
      "name" : "input.293",
      "deconv_out_height" : 64,
